wolfSSL/wolfip/src/port/stm32n6/main.c
/* main.c
 *
 * STM32N6 (NUCLEO-N657X0-Q, Cortex-M55) wolfIP echo server.
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfIP TCP/IP stack.
 *
 * wolfIP is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfIP is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */
#include <stdint.h>
#include <string.h>
#include "config.h"
#include "wolfip.h"
#include "stm32_eth.h"

/* Forward declarations */
static void uart_puts(const char *s);
static void delay(uint32_t count);

/* =========================================================================
 * RCC — Reset and Clock Control (base 0x56028000, secure bus)
 * ========================================================================= */
#define RCC_BASE          0x56028000UL

/* Control: direct read / set (+0x800) / clear (+0x1000) */
#define RCC_CR            (*(volatile uint32_t *)(RCC_BASE + 0x000u))
#define RCC_CSR           (*(volatile uint32_t *)(RCC_BASE + 0x800u))
#define RCC_CCR           (*(volatile uint32_t *)(RCC_BASE + 0x1000u))
#define RCC_CR_HSION      (1u << 3)
#define RCC_CR_PLL1ON     (1u << 8)

/* Status — ready flags */
#define RCC_SR            (*(volatile uint32_t *)(RCC_BASE + 0x04u))
#define RCC_SR_HSIRDY     (1u << 3)
#define RCC_SR_PLL1RDY    (1u << 8)

/* Clock switching */
#define RCC_CFGR1         (*(volatile uint32_t *)(RCC_BASE + 0x20u))
#define RCC_CFGR1_CPUSW_SHIFT   16u
#define RCC_CFGR1_CPUSW_MASK    (0x3u << 16u)
#define RCC_CFGR1_CPUSWS_SHIFT  20u
#define RCC_CFGR1_CPUSWS_MASK   (0x3u << 20u)
#define RCC_CFGR1_SYSSW_SHIFT   24u
#define RCC_CFGR1_SYSSW_MASK    (0x3u << 24u)
#define RCC_CFGR1_SYSSWS_SHIFT  28u
#define RCC_CFGR1_SYSSWS_MASK   (0x3u << 28u)

/* AHB/APB prescalers */
#define RCC_CFGR2         (*(volatile uint32_t *)(RCC_BASE + 0x24u))
#define RCC_CFGR2_HPRE_SHIFT  20u
#define RCC_CFGR2_HPRE_MASK   (0x7u << 20u)

/* PLL1 configuration */
#define RCC_PLL1CFGR1     (*(volatile uint32_t *)(RCC_BASE + 0x80u))
#define RCC_PLL1CFGR1_SEL_MASK   (0x7u << 28u)
#define RCC_PLL1CFGR1_DIVM_MASK  (0x3Fu << 20u)
#define RCC_PLL1CFGR1_DIVN_MASK  (0xFFFu << 8u)
#define RCC_PLL1CFGR1_BYP        (1u << 27u)
#define RCC_PLL1CFGR1_SEL_HSI    (0x0u << 28u)
#define RCC_PLL1CFGR1_DIVM_SHIFT 20u
#define RCC_PLL1CFGR1_DIVN_SHIFT 8u

#define RCC_PLL1CFGR2     (*(volatile uint32_t *)(RCC_BASE + 0x84u))

#define RCC_PLL1CFGR3     (*(volatile uint32_t *)(RCC_BASE + 0x88u))
#define RCC_PLL1CFGR3_PDIV1_SHIFT 27u
#define RCC_PLL1CFGR3_PDIV2_SHIFT 24u
#define RCC_PLL1CFGR3_MODSSDIS   (1u << 2u)
#define RCC_PLL1CFGR3_MODSSRST   (1u << 0u)
#define RCC_PLL1CFGR3_PDIVEN     (1u << 30u)

/* IC dividers */
#define RCC_IC1CFGR       (*(volatile uint32_t *)(RCC_BASE + 0xC4u))
#define RCC_IC2CFGR       (*(volatile uint32_t *)(RCC_BASE + 0xC8u))
#define RCC_IC6CFGR       (*(volatile uint32_t *)(RCC_BASE + 0xD8u))
#define RCC_IC11CFGR      (*(volatile uint32_t *)(RCC_BASE + 0xECu))
#define RCC_ICCFGR_INT_SHIFT  16u
#define RCC_ICCFGR_SEL_PLL1  (0x0u << 28u)

/* Divider enable: direct / set (+0x800) / clear (+0x1000) */
#define RCC_DIVENR        (*(volatile uint32_t *)(RCC_BASE + 0x240u))
#define RCC_DIVENSR       (*(volatile uint32_t *)(RCC_BASE + 0xA40u))
#define RCC_DIVENCR       (*(volatile uint32_t *)(RCC_BASE + 0x1240u))
#define RCC_DIVENR_IC1EN  (1u << 0u)
#define RCC_DIVENR_IC2EN  (1u << 1u)
#define RCC_DIVENR_IC6EN  (1u << 5u)
#define RCC_DIVENR_IC11EN (1u << 10u)

/* Peripheral clock enable — use SET registers (write 1s to set bits).
 * Direct ENR registers are read-only status; ENSR is the set register. */
#define RCC_AHB1ENR       (*(volatile uint32_t *)(RCC_BASE + 0x250u))  /* read */
#define RCC_AHB2ENR       (*(volatile uint32_t *)(RCC_BASE + 0x254u))  /* read */
#define RCC_AHB3ENR       (*(volatile uint32_t *)(RCC_BASE + 0x258u))  /* read */
#define RCC_AHB4ENR       (*(volatile uint32_t *)(RCC_BASE + 0x25Cu))  /* read */
#define RCC_AHB5ENR       (*(volatile uint32_t *)(RCC_BASE + 0x260u))  /* read */
#define RCC_APB2ENR       (*(volatile uint32_t *)(RCC_BASE + 0x26Cu))  /* read */
#define RCC_MEMENR        (*(volatile uint32_t *)(RCC_BASE + 0x24Cu))  /* read */

/* SET registers — write-only, bits written as 1 get set in ENR */
#define RCC_AHB2ENSR      (*(volatile uint32_t *)(RCC_BASE + 0xA54u))
#define RCC_AHB3ENSR      (*(volatile uint32_t *)(RCC_BASE + 0xA58u))
#define RCC_AHB4ENSR      (*(volatile uint32_t *)(RCC_BASE + 0xA5Cu))
#define RCC_AHB5ENSR      (*(volatile uint32_t *)(RCC_BASE + 0xA60u))
#define RCC_APB2ENSR      (*(volatile uint32_t *)(RCC_BASE + 0xA6Cu))
#define RCC_MEMENSR       (*(volatile uint32_t *)(RCC_BASE + 0xA4Cu))

/* Clock configuration — ETH PHY interface selection */
#define RCC_CCIPR2        (*(volatile uint32_t *)(RCC_BASE + 0x148u))
#define RCC_CCIPR2_ETH1SEL_RMII    (0x4u << 16u) /* bit 18 = RMII mode */

/* Peripheral reset */
#define RCC_AHB1RSTR      (*(volatile uint32_t *)(RCC_BASE + 0x210u))
#define RCC_AHB5RSTR      (*(volatile uint32_t *)(RCC_BASE + 0x220u))

/* =========================================================================
 * GPIO — secure bus addresses
 * ========================================================================= */
#define GPIOA_BASE        0x56020000UL
#define GPIOB_BASE        0x56020400UL
#define GPIOC_BASE        0x56020800UL
#define GPIOE_BASE        0x56021000UL
#define GPIOF_BASE        0x56021400UL
#define GPIOG_BASE        0x56021800UL
#define GPIOO_BASE        0x56023800UL

#define GPIO_MODER(base)   (*(volatile uint32_t *)((base) + 0x00u))
#define GPIO_OSPEEDR(base) (*(volatile uint32_t *)((base) + 0x08u))
#define GPIO_PUPDR(base)   (*(volatile uint32_t *)((base) + 0x0Cu))
#define GPIO_ODR(base)     (*(volatile uint32_t *)((base) + 0x14u))
#define GPIO_BSRR(base)    (*(volatile uint32_t *)((base) + 0x18u))
#define GPIO_AFRL(base)    (*(volatile uint32_t *)((base) + 0x20u))
#define GPIO_AFRH(base)    (*(volatile uint32_t *)((base) + 0x24u))

/* =========================================================================
 * PWR — Power Control (base 0x56024800)
 * ========================================================================= */
#define PWR_BASE          0x56024800UL
#define PWR_SVMCR1        (*(volatile uint32_t *)(PWR_BASE + 0x34u))
#define PWR_SVMCR2        (*(volatile uint32_t *)(PWR_BASE + 0x38u))
#define PWR_SVMCR3        (*(volatile uint32_t *)(PWR_BASE + 0x3Cu))
#define PWR_SVMCR1_VDDIO4SV  (1u << 8u)
#define PWR_SVMCR2_VDDIO5SV  (1u << 8u)
#define PWR_SVMCR3_VDDIO2SV  (1u << 8u)
#define PWR_SVMCR3_VDDIO3SV  (1u << 9u)

/* =========================================================================
 * USART1 — PE5 (TX) / PE6 (RX), AF7 (base 0x52001000)
 * ========================================================================= */
#define USART1_BASE       0x52001000UL
#define USART1_CR1        (*(volatile uint32_t *)(USART1_BASE + 0x00u))
#define USART1_CR2        (*(volatile uint32_t *)(USART1_BASE + 0x04u))
#define USART1_CR3        (*(volatile uint32_t *)(USART1_BASE + 0x08u))
#define USART1_BRR        (*(volatile uint32_t *)(USART1_BASE + 0x0Cu))
#define USART1_ISR        (*(volatile uint32_t *)(USART1_BASE + 0x1Cu))
#define USART1_TDR        (*(volatile uint32_t *)(USART1_BASE + 0x28u))

/* =========================================================================
 * SCB — Cortex-M55 cache control
 * ========================================================================= */
#define SCB_CCR           (*(volatile uint32_t *)(0xE000ED14UL))
#define SCB_CCR_IC        (1u << 17u)
#define SCB_CCR_DC        (1u << 16u)
#define SCB_ICIALLU       (*(volatile uint32_t *)(0xE000EF50UL))

/* =========================================================================
 * MPU — Cortex-M55 ARMv8.1-M Memory Protection Unit
 * ========================================================================= */
#define MPU_TYPE          (*(volatile uint32_t *)(0xE000ED90UL))
#define MPU_CTRL          (*(volatile uint32_t *)(0xE000ED94UL))
#define MPU_RNR           (*(volatile uint32_t *)(0xE000ED98UL))
#define MPU_RBAR          (*(volatile uint32_t *)(0xE000ED9CUL))
#define MPU_RLAR          (*(volatile uint32_t *)(0xE000EDA0UL))
#define MPU_MAIR0         (*(volatile uint32_t *)(0xE000EDC0UL))
#define MPU_MAIR1         (*(volatile uint32_t *)(0xE000EDC4UL))

/* =========================================================================
 * Fault registers
 * ========================================================================= */
#define SCB_HFSR          (*(volatile uint32_t *)0xE000ED2CUL)
#define SCB_CFSR          (*(volatile uint32_t *)0xE000ED28UL)
#define SCB_BFAR          (*(volatile uint32_t *)0xE000ED38UL)
#define SCB_MMFAR         (*(volatile uint32_t *)0xE000ED34UL)

/* =========================================================================
 * Barrier macros
 * ========================================================================= */
#define DSB() __asm volatile ("dsb sy" ::: "memory")
#define ISB() __asm volatile ("isb sy" ::: "memory")
#define DMB() __asm volatile ("dmb sy" ::: "memory")

/* =========================================================================
 * LED — LD1 green on PO1 (GPIOO), LD2 red on PG10 (GPIOG)
 * Note: These are from the N6570-DK DTS. NUCLEO board may differ.
 * ========================================================================= */
#define LED1_PORT         GPIOO_BASE
#define LED1_PIN          1u
#define LED1_RCC_BIT      14u   /* RCC_AHB4ENR bit for GPIOO */

