wolfSSL/wolfip/src/port/stm32n6/main.c
#define ECHO_PORT 7
#define RX_BUF_SIZE 1024

static struct wolfIP *IPStack;
static int listen_fd = -1;
static int client_fd = -1;
static uint8_t rx_buf[RX_BUF_SIZE];

/* =========================================================================
 * HardFault Handler — safe version that won't cause LOCKUP
 *
 * IMPORTANT: Do NOT access USART or other peripherals here unless we know
 * their clocks are enabled. Accessing unclocked peripherals from the fault
 * handler causes a double-fault → CPU LOCKUP (unrecoverable without NRST).
 * ========================================================================= */
static volatile int uart_ready = 0;

#define FAULT_USART1_ISR  (*(volatile uint32_t *)(USART1_BASE + 0x1Cu))
#define FAULT_USART1_TDR  (*(volatile uint32_t *)(USART1_BASE + 0x28u))

static void fault_uart_putc(char c)
{
    while ((FAULT_USART1_ISR & (1u << 7)) == 0) { }
    FAULT_USART1_TDR = (uint32_t)c;
}

static void fault_uart_puts(const char *s)
{
    while (*s) {
        if (*s == '\n') fault_uart_putc('\r');
        fault_uart_putc(*s++);
    }
}

static void fault_uart_puthex(uint32_t val)
{
    const char hex[] = "0123456789ABCDEF";
    fault_uart_puts("0x");
    for (int i = 28; i >= 0; i -= 4)
        fault_uart_putc(hex[(val >> i) & 0xF]);
}

void hard_fault_handler_c(uint32_t *frame)
{
    if (uart_ready) {
        fault_uart_puts("\n\n*** HARD FAULT ***\n");
        fault_uart_puts("  PC:   "); fault_uart_puthex(frame[6]); fault_uart_puts("\n");
        fault_uart_puts("  LR:   "); fault_uart_puthex(frame[5]); fault_uart_puts("\n");
        fault_uart_puts("  R0:   "); fault_uart_puthex(frame[0]); fault_uart_puts("\n");
        fault_uart_puts("  R1:   "); fault_uart_puthex(frame[1]); fault_uart_puts("\n");
        fault_uart_puts("  R2:   "); fault_uart_puthex(frame[2]); fault_uart_puts("\n");
        fault_uart_puts("  R3:   "); fault_uart_puthex(frame[3]); fault_uart_puts("\n");
        fault_uart_puts("  R12:  "); fault_uart_puthex(frame[4]); fault_uart_puts("\n");
        fault_uart_puts("  xPSR: "); fault_uart_puthex(frame[7]); fault_uart_puts("\n");
        fault_uart_puts("  HFSR: "); fault_uart_puthex(SCB_HFSR); fault_uart_puts("\n");
        fault_uart_puts("  CFSR: "); fault_uart_puthex(SCB_CFSR); fault_uart_puts("\n");
        if (SCB_CFSR & 0x00008200u) {
            fault_uart_puts("  BFAR: "); fault_uart_puthex(SCB_BFAR); fault_uart_puts("\n");
        }
        if (SCB_CFSR & 0x00000082u) {
            fault_uart_puts("  MMFAR:"); fault_uart_puthex(SCB_MMFAR); fault_uart_puts("\n");
        }
    }
    /* Bare spin — do NOT access any peripherals (GPIO, UART) here.
     * If the fault happens before peripheral clocks are enabled,
     * any peripheral access would cause a double-fault → LOCKUP.
     * Use GDB to inspect fault registers instead. */
    while (1) { }
}

void HardFault_Handler(void) __attribute__((naked));
void HardFault_Handler(void)
{
    __asm volatile(
        "tst lr, #4       \n"
        "ite eq            \n"
        "mrseq r0, msp     \n"
        "mrsne r0, psp     \n"
        "b hard_fault_handler_c \n"
    );
}

/* =========================================================================
 * Clock Configuration — PLL1 → 600 MHz CPU
 *
 * HSI 64 MHz → PLL1 (M=4, N=75) → VCO 1200 MHz → PDIV1=1 → 1200 MHz
 *   IC1 /2 = 600 MHz → CPU
 *   IC2 /3 = 400 MHz → AXI bus
 *   IC6 /4 = 300 MHz → system bus C
 *   IC11/3 = 400 MHz → system bus D
 * AHB prescaler /2 → HCLK = 300 MHz
 * ========================================================================= */
static void clock_config(void)
{
    uint32_t reg;

    /* Enable HSI 64 MHz */
    RCC_CSR = RCC_CR_HSION;
    while (!(RCC_SR & RCC_SR_HSIRDY))
        ;

    /* Disable PLL1 before reconfiguring */
    RCC_CCR = RCC_CR_PLL1ON;
    while (RCC_SR & RCC_SR_PLL1RDY)
        ;

    /* PLL1: HSI / 4 * 75 = 1200 MHz VCO.
     * Clear BYP — Boot ROM leaves it set. */
    reg = RCC_PLL1CFGR1;
    reg &= ~(RCC_PLL1CFGR1_SEL_MASK | RCC_PLL1CFGR1_DIVM_MASK |
             RCC_PLL1CFGR1_DIVN_MASK | RCC_PLL1CFGR1_BYP);
    reg |= RCC_PLL1CFGR1_SEL_HSI |
           (4u << RCC_PLL1CFGR1_DIVM_SHIFT) |
           (75u << RCC_PLL1CFGR1_DIVN_SHIFT);
    RCC_PLL1CFGR1 = reg;

    RCC_PLL1CFGR2 = 0; /* no fractional */

    /* PDIV1=1, PDIV2=1 → PLL output = VCO = 1200 MHz */
    RCC_PLL1CFGR3 = (1u << RCC_PLL1CFGR3_PDIV1_SHIFT) |
                    (1u << RCC_PLL1CFGR3_PDIV2_SHIFT) |
                    RCC_PLL1CFGR3_MODSSDIS |
                    RCC_PLL1CFGR3_MODSSRST |
                    RCC_PLL1CFGR3_PDIVEN;

    /* Enable PLL1, wait for lock */
    RCC_CSR = RCC_CR_PLL1ON;
    while (!(RCC_SR & RCC_SR_PLL1RDY))
        ;

    /* Configure IC dividers: disable → configure → re-enable */
    RCC_DIVENCR = RCC_DIVENR_IC1EN;
    RCC_IC1CFGR = RCC_ICCFGR_SEL_PLL1 | ((2u - 1u) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC1EN;

    RCC_DIVENCR = RCC_DIVENR_IC2EN;
    RCC_IC2CFGR = RCC_ICCFGR_SEL_PLL1 | ((3u - 1u) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC2EN;

    RCC_DIVENCR = RCC_DIVENR_IC6EN;
    RCC_IC6CFGR = RCC_ICCFGR_SEL_PLL1 | ((4u - 1u) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC6EN;

    RCC_DIVENCR = RCC_DIVENR_IC11EN;
    RCC_IC11CFGR = RCC_ICCFGR_SEL_PLL1 | ((3u - 1u) << RCC_ICCFGR_INT_SHIFT);
    RCC_DIVENSR = RCC_DIVENR_IC11EN;

    /* AHB prescaler /2 → HCLK = 300 MHz */
    reg = RCC_CFGR2;
    reg &= ~RCC_CFGR2_HPRE_MASK;
    reg |= (1u << RCC_CFGR2_HPRE_SHIFT);
    RCC_CFGR2 = reg;

    /* Switch CPU to IC1, system bus to IC2/IC6/IC11 */
    reg = RCC_CFGR1;
    reg &= ~(RCC_CFGR1_CPUSW_MASK | RCC_CFGR1_SYSSW_MASK);
    reg |= (0x3u << RCC_CFGR1_CPUSW_SHIFT) |
           (0x3u << RCC_CFGR1_SYSSW_SHIFT);
    RCC_CFGR1 = reg;
    while ((RCC_CFGR1 & RCC_CFGR1_CPUSWS_MASK) !=
           (0x3u << RCC_CFGR1_CPUSWS_SHIFT))
        ;
    while ((RCC_CFGR1 & RCC_CFGR1_SYSSWS_MASK) !=
           (0x3u << RCC_CFGR1_SYSSWS_SHIFT))
        ;
}

/* =========================================================================
 * Power — mark VDDIO supplies valid
 * ========================================================================= */
static void pwr_enable_io_supply(void)
{
    /* Enable PWR peripheral clock */
    RCC_AHB4ENSR = (1u << 18u); /* PWREN */
    DMB();
    PWR_SVMCR1 |= PWR_SVMCR1_VDDIO4SV;
    PWR_SVMCR2 |= PWR_SVMCR2_VDDIO5SV;
    PWR_SVMCR3 |= PWR_SVMCR3_VDDIO2SV | PWR_SVMCR3_VDDIO3SV;
    DMB();
}

/* =========================================================================
 * Cache
 * ========================================================================= */
static void icache_enable(void)
{
    DSB(); ISB();
    SCB_ICIALLU = 0;
    DSB(); ISB();
    SCB_CCR |= SCB_CCR_IC;
    DSB(); ISB();
}

static void dcache_enable(void)
{
    DSB();
    SCB_CCR |= SCB_CCR_DC;
    DSB(); ISB();
}

/* =========================================================================
 * MPU — Configure ETH DMA buffer region as non-cacheable
 *
 * Cortex-M55 ARMv8.1-M MPU:
 *   RBAR: base address | AP[2:1] | XN[0]
 *   RLAR: limit address | AttrIdx[3:1] | EN[0]
 *   MAIR: attribute encoding per index
 *
 * ETH buffers (.eth_buffers) are in AXISRAM2 at 0x34100000.
 * ========================================================================= */
static void mpu_configure_eth_nocache(void)
{
    /* Disable MPU */
    MPU_CTRL = 0;
    DSB();

    /* Region 0: AXISRAM2 (ETH DMA buffers), non-cacheable Normal memory */
    MPU_RNR = 0;
    MPU_RBAR = 0x34100000u | (1u << 1u) | (1u << 0u);
    MPU_RLAR = (0x3410FFFFu & ~0x1Fu) | (2u << 1u) | 1u;

    /* MAIR0: Attr2 (bits [23:16]) = 0x44 → Normal, Non-cacheable */
    MPU_MAIR0 = (0x44u << 16u);

    /* Enable MPU + PRIVDEFENA (default map for other regions) */
    MPU_CTRL = 5u;
    DSB(); ISB();
}

/* =========================================================================
 * Simple delay
 * ========================================================================= */
static void delay(uint32_t count)
{
    for (volatile uint32_t i = 0; i < count; i++) { }
}

/* =========================================================================
 * LED — LD1 green on PO1
 * ========================================================================= */
static void led_init(void)
{
    uint32_t moder;

