wolfSSL/wolfip/src/port/stm32n6/main.c
    /* Enable GPIOO clock */
    RCC_AHB4ENSR = (1u << LED1_RCC_BIT);
    delay(100);

    /* Set PO1 as output */
    moder = GPIO_MODER(LED1_PORT);
    moder &= ~(3u << (LED1_PIN * 2u));
    moder |= (1u << (LED1_PIN * 2u));
    GPIO_MODER(LED1_PORT) = moder;
}

static void led_on(void)
{
    GPIO_BSRR(LED1_PORT) = (1u << LED1_PIN);
}

static void led_off(void)
{
    GPIO_BSRR(LED1_PORT) = (1u << (LED1_PIN + 16u));
}

static void led_toggle(void)
{
    GPIO_ODR(LED1_PORT) ^= (1u << LED1_PIN);
}

/* =========================================================================
 * UART — USART1 on PE5 (TX) / PE6 (RX), AF7
 *
 * HCLK (APB2 clock after PLL) = 300 MHz
 * BRR = 300000000 / 115200 = 2604
 * ========================================================================= */
static void uart_init(void)
{
    uint32_t moder, afr;

    /* Enable GPIOE + USART1 clocks */
    RCC_AHB4ENSR = (1u << 4u);   /* GPIOEEN */
    RCC_APB2ENSR = (1u << 4u);   /* USART1EN */
    delay(100);

    /* PE5 + PE6 → AF mode */
    moder = GPIO_MODER(GPIOE_BASE);
    moder &= ~((3u << (5u * 2u)) | (3u << (6u * 2u)));
    moder |= (2u << (5u * 2u)) | (2u << (6u * 2u));
    GPIO_MODER(GPIOE_BASE) = moder;

    /* High speed */
    GPIO_OSPEEDR(GPIOE_BASE) |= (3u << (5u * 2u)) | (3u << (6u * 2u));

    /* AF7 for PE5 and PE6 (both in AFRL since pins < 8) */
    afr = GPIO_AFRL(GPIOE_BASE);
    afr &= ~((0xFu << (5u * 4u)) | (0xFu << (6u * 4u)));
    afr |= (7u << (5u * 4u)) | (7u << (6u * 4u));
    GPIO_AFRL(GPIOE_BASE) = afr;

    /* Configure USART1: 115200 baud
     * After reset the CPU runs at HSI 64 MHz, but the APB2 clock feeding
     * USART1 is 32 MHz (IC2 default divider = 2).
     * BRR is re-configured after clock_config() switches to PLL. */
    USART1_CR1 = 0;
    USART1_CR2 = 0;
    USART1_CR3 = 0;
    USART1_BRR = 32000000u / 115200u; /* 278 */

    /* Enable transmitter + receiver + USART */
    USART1_CR1 = (1u << 3u) | (1u << 2u); /* TE + RE */
    delay(10);
    USART1_CR1 |= (1u << 0u); /* UE */
    delay(100);
}

static void uart_putc(char c)
{
    while ((USART1_ISR & (1u << 7u)) == 0) { } /* Wait for TXE */
    USART1_TDR = (uint32_t)c;
}

static void uart_puts(const char *s)
{
    while (*s) {
        if (*s == '\n') uart_putc('\r');
        uart_putc(*s++);
    }
}

static void uart_puthex(uint32_t val)
{
    const char hex[] = "0123456789ABCDEF";
    uart_puts("0x");
    for (int i = 28; i >= 0; i -= 4) {
        uart_putc(hex[(val >> i) & 0xF]);
    }
}

static void uart_puthex8(uint8_t val)
{
    const char hex[] = "0123456789ABCDEF";
    uart_putc(hex[(val >> 4) & 0xF]);
    uart_putc(hex[val & 0xF]);
}

static void uart_putdec(uint32_t val)
{
    char buf[12];
    int i = 0;
    if (val == 0) {
        uart_putc('0');
        return;
    }
    while (val > 0 && i < 11) {
        buf[i++] = '0' + (val % 10);
        val /= 10;
    }
    while (i > 0) {
        uart_putc(buf[--i]);
    }
}

static void uart_putip4(ip4 ip)
{
    uart_putdec((ip >> 24) & 0xFF);
    uart_putc('.');
    uart_putdec((ip >> 16) & 0xFF);
    uart_putc('.');
    uart_putdec((ip >> 8) & 0xFF);
    uart_putc('.');
    uart_putdec(ip & 0xFF);
}

/* wolfIP requires this symbol */
uint32_t wolfIP_getrandom(void)
{
    /* Simple LFSR-based PRNG — no HW RNG on initial bring-up.
     * Replace with TRNG when available. */
    static uint32_t state = 0xDEADBEEF;
    state ^= state << 13;
    state ^= state >> 17;
    state ^= state << 5;
    return state;
}

/* =========================================================================
 * SYSCFG — I/O compensation for VDDIO3 (Ethernet GPIOF pins)
 *
 * SYSCFG base = 0x56008000 (secure, APB4 + 0x8000).
 * VDDIO3CCCR (offset 0x5C): compensation cell control for GPIOF.
 *   bit 8 = EN (enable compensation cell)
 *   bit 9 = CS (code selection: 0=auto, 1=manual)
 * VDDIO3CCSR (offset 0x60): compensation cell status (RDY bit).
 * ========================================================================= */
#define SYSCFG_BASE       0x56008000UL
#define SYSCFG_VDDIO3CCCR (*(volatile uint32_t *)(SYSCFG_BASE + 0x5Cu))
#define SYSCFG_VDDIO3CCSR (*(volatile uint32_t *)(SYSCFG_BASE + 0x60u))

/* RCC clock for SYSCFG — APB4ENR2 at offset 0x278, bit 0 = SYSCFGEN */
#define RCC_APB4ENR2      (*(volatile uint32_t *)(RCC_BASE + 0x278u))
#define RCC_APB4ENSR2     (*(volatile uint32_t *)(RCC_BASE + 0xA78u))

/* =========================================================================
 * Ethernet GPIO — RMII pin configuration (NUCLEO-N657X0-Q)
 *
 * Pin mapping (AF11) — all on GPIOF except MDC on PG11:
 *   PF4  — ETH_MDIO       PG11 — ETH_MDC
 *   PF7  — ETH_REF_CLK    PF10 — ETH_CRS_DV
 *   PF11 — ETH_TX_EN      PF12 — ETH_TXD0     PF13 — ETH_TXD1
 *   PF14 — ETH_RXD0       PF15 — ETH_RXD1
 * ========================================================================= */
static void gpio_eth_pin(uint32_t base, uint32_t pin)
{
    uint32_t moder, ospeedr, afr;
    uint32_t pos2 = pin * 2u;

    /* Alternate function mode (0b10) */
    moder = GPIO_MODER(base);
    moder &= ~(3u << pos2);
    moder |= (2u << pos2);
    GPIO_MODER(base) = moder;

    /* High speed */
    ospeedr = GPIO_OSPEEDR(base);
    ospeedr |= (3u << pos2);
    GPIO_OSPEEDR(base) = ospeedr;

    /* AF11 for Ethernet */
    if (pin < 8u) {
        afr = GPIO_AFRL(base);
        afr &= ~(0xFu << (pin * 4u));
        afr |= (11u << (pin * 4u));
        GPIO_AFRL(base) = afr;
    } else {
        afr = GPIO_AFRH(base);
        afr &= ~(0xFu << ((pin - 8u) * 4u));
        afr |= (11u << ((pin - 8u) * 4u));
        GPIO_AFRH(base) = afr;
    }
}

static void eth_gpio_init(void)
{
    /* Enable GPIO clocks: F and G */
    RCC_AHB4ENSR = (1u << 5u) | (1u << 6u); /* GPIOFEN + GPIOGEN */
    delay(1000);

    /* Power on AXISRAM2 for ETH DMA buffers.
     * AXISRAM2-6 are powered down by default after boot ROM. */
    {
        volatile uint32_t *ramcfg_sram2_cr = (volatile uint32_t *)0x52023080u;
        RCC_AHB2ENSR = (1u << 12u); /* RAMCFGEN */
        RCC_MEMENSR = (1u << 1u); /* AXISRAM2EN */
        delay(100);
        *ramcfg_sram2_cr &= ~(1u << 20u); /* Clear SRAMSD → power on */
        DSB();
        delay(10000);
    }

    /* Configure RIFSC: grant ETH1 DMA (RIMC master 6) memory access.
     * RIMC_ATTR6: DSEL=1 (use default CID), DSEC=0 (non-secure), DPRIV=1 (privileged)
     * RIFSC_BASE = 0x54024000, RIMC_ATTR[6] at offset 0xC10 + 6*4 = 0xC28 */
    {
        volatile uint32_t *rimc_attr6 = (volatile uint32_t *)(0x54024000u + 0xC28u);
        RCC_AHB3ENSR = (1u << 9u); /* RIFSCEN */
        delay(100);
        /* CID=1, DSEL=1, DSEC=1 (secure), DPRIV=1 — matches CubeN6 example */
        *rimc_attr6 = (1u << 0u) | (1u << 4u) | (1u << 8u) | (1u << 9u);
        DSB();
        uart_puts("  RIMC_ATTR6 (ETH1): ");
        uart_puthex(*rimc_attr6);
        uart_puts("\n");
    }

    /* Enable SYSCFG clock and configure VDDIO3 I/O compensation.
     * GPIOF pins are on VDDIO3 — compensation cell must be enabled
     * for the RMII data signals to work at 50 MHz. */
    RCC_APB4ENSR2 = (1u << 0u); /* SYSCFGEN */
    delay(100);
    SYSCFG_VDDIO3CCCR |= (1u << 8u); /* EN = 1 (enable compensation) */
    DSB();

    /* Enable HSLV (1.8V) mode for VDDIO3 (GPIOF Ethernet pins).
     * The VDDIO3VRSEL bit in PWR_SVMCR3 is protected by OTP124 bit 15.
     * Write the BSEC shadow register first to unlock it (non-permanent). */
    {
        volatile uint32_t *bsec_fvr124 = (volatile uint32_t *)0x560091F0u;
        *bsec_fvr124 |= (1u << 15u); /* HSLV_VDDIO3 shadow */
        DSB();
        PWR_SVMCR3 |= (1u << 26u); /* VDDIO3VRSEL = 1.8V */
        DMB();
    }

    /* Configure RMII pins (AF11) — NUCLEO-N657X0-Q pinout */
    gpio_eth_pin(GPIOF_BASE, 4);   /* MDIO */
    gpio_eth_pin(GPIOG_BASE, 11);  /* MDC */
    gpio_eth_pin(GPIOF_BASE, 7);   /* REF_CLK */
    gpio_eth_pin(GPIOF_BASE, 10);  /* CRS_DV */
    gpio_eth_pin(GPIOF_BASE, 11);  /* TX_EN */
    gpio_eth_pin(GPIOF_BASE, 12);  /* TXD0 */
    gpio_eth_pin(GPIOF_BASE, 13);  /* TXD1 */
    gpio_eth_pin(GPIOF_BASE, 14);  /* RXD0 */
    gpio_eth_pin(GPIOF_BASE, 15);  /* RXD1 */
}

/* =========================================================================
 * TCP echo callback — stack-agnostic, mirrors H563 implementation
 * ========================================================================= */
static void echo_cb(int fd, uint16_t event, void *arg)
{
    struct wolfIP *s = (struct wolfIP *)arg;
    int ret;

    if ((fd == listen_fd) && (event & CB_EVENT_READABLE) && (client_fd == -1)) {
        client_fd = wolfIP_sock_accept(s, listen_fd, NULL, NULL);
        if (client_fd > 0) {
            wolfIP_register_callback(s, client_fd, echo_cb, s);
        }
        return;
    }

