wolfSSL/wolfip/src/port/stm32n6/main.c
    if ((fd == client_fd) && (event & CB_EVENT_READABLE)) {
        ret = wolfIP_sock_recvfrom(s, client_fd, rx_buf, sizeof(rx_buf), 0, NULL, NULL);
        if (ret > 0) {
            (void)wolfIP_sock_sendto(s, client_fd, rx_buf, (uint32_t)ret, 0, NULL, 0);
        } else if (ret == 0) {
            wolfIP_sock_close(s, client_fd);
            client_fd = -1;
        }
    }

    if ((fd == client_fd) && (event & CB_EVENT_CLOSED)) {
        wolfIP_sock_close(s, client_fd);
        client_fd = -1;
    }
}

/* =========================================================================
 * main
 * ========================================================================= */
int main(void)
{
    struct wolfIP_ll_dev *ll;
    struct wolfIP_sockaddr_in addr;
    uint64_t tick = 0;
    int ret;

    /* LED first — absolute minimum, just GPIO clock + pin mode.
     * This ensures the HardFault handler can blink the LED. */
    pwr_enable_io_supply();

    /* Enable HSLV mode for VDDIO3 — AFTER pwr_enable_io_supply to avoid
     * the PWR_SVMCR3 read-modify-write from clearing VRSEL.
     * VDDIO3 is 1.8V on NUCLEO-N657X0-Q. Without HSLV, I/O pads can't
     * switch fast enough for 50MHz RMII Ethernet.
     * BSEC shadow register unlocks the PWR VRSEL write (non-permanent). */
    {
        volatile uint32_t *bsec_fvr124 = (volatile uint32_t *)0x560091F0u;
        *bsec_fvr124 |= (1u << 15u); /* HSLV_VDDIO3 shadow */
        __asm volatile ("dsb sy" ::: "memory");
        for (volatile uint32_t d = 0; d < 10000; d++) {} /* Wait for BSEC */
        PWR_SVMCR3 |= (1u << 26u); /* VDDIO3VRSEL = 1.8V */
        __asm volatile ("dmb sy" ::: "memory");
    }
    led_init();
    led_on();

    /* UART init — after this, HardFault handler can print diagnostics */
    uart_init(); /* Uses HSI 64 MHz for now — BRR adjusted below */
    uart_ready = 1;

    uart_puts("\n[BOOT] LED+UART OK at HSI\n");
    uart_puts("[BOOT] Enabling PLL...\n");
    clock_config();
    /* UART baud is now wrong (clock changed) — just keep going.
     * Ping test doesn't need UART output. */
    icache_enable();
    mpu_configure_eth_nocache();
    dcache_enable();

    /* Blink to confirm UART init */
    led_off(); delay(200000);
    led_on();  delay(200000);
    led_off(); delay(200000);
    led_on();

    uart_puts("\n\n=== wolfIP STM32N6 Echo Server ===\n");

    /* Initialize wolfIP stack */
    uart_puts("Initializing wolfIP stack...\n");
    wolfIP_init_static(&IPStack);

    /* ETH init sequence:
     * 1. Configure GPIO for RMII (pins + VDDIO3 compensation + RIMC)
     * 2. Select RMII mode in CCIPR2 BEFORE enabling ETH clocks
     * 3. Enable ETH clocks
     * 4. Reset ETH MAC */

    /* Step 1: GPIO and peripheral setup */
    eth_gpio_init();

    /* Step 2: RMII mode select — must be before ETH clocks on some STM32 */
    /* ETH1SEL = RMII (bit 18) */
    RCC_CCIPR2 |= RCC_CCIPR2_ETH1SEL_RMII;
    DSB();
    delay(1000);

    /* Step 3: Enable Ethernet clocks (AHB5) */
    /* Only enable MAC, TX, RX clocks (NOT ETH1EN at bit 25 — per CubeN6 example) */
    RCC_AHB5ENSR = (1u << 22u) | (1u << 23u) | (1u << 24u);
    DSB();
    delay(10000);

    /* Step 4: Reset Ethernet MAC */
    RCC_AHB5RSTR |= (1u << 22u);
    DSB();
    delay(1000);
    RCC_AHB5RSTR &= ~(1u << 22u);
    DSB();
    delay(100000);  /* Longer delay after reset */

    /* Verify ETH peripheral is accessible */
    {
        volatile uint32_t *eth_maccr = (volatile uint32_t *)0x58036000u;
        volatile uint32_t *eth_dmamr = (volatile uint32_t *)0x58037000u;
        volatile uint32_t *eth_dmadsr = (volatile uint32_t *)0x58037008u;
        uart_puts("  ETH1_MACCR  @0x58036000: ");
        uart_puthex(*eth_maccr);
        uart_puts("\n  ETH1_DMAMR  @0x58037000: ");
        uart_puthex(*eth_dmamr);
        uart_puts("\n  ETH1_DMADSR @0x58037008: ");
        uart_puthex(*eth_dmadsr);
        uart_puts("\n");
        /* Try DMA SWR manually */
        uart_puts("  Writing SWR...\n");
        *eth_dmamr |= 1u;
        delay(100000);
        uart_puts("  ETH1_DMAMR after SWR: ");
        uart_puthex(*eth_dmamr);
        uart_puts("\n");
    }

    /* Test MDIO directly before full init */
    {
        volatile uint32_t *macmdioar = (volatile uint32_t *)0x58036200u;
        volatile uint32_t *macmdiodr = (volatile uint32_t *)0x58036204u;
        uint32_t cfg, to;
        uart_puts("  MDIO test: reading PHY0 reg2...\n");
        /* CR=0, RDA=2 (ID1), PA=0, GOC=3 (read), MB=1 */
        cfg = (0u << 8) | (2u << 16) | (0u << 21) | (3u << 2) | 1u;
        *macmdioar = cfg;
        to = 100000;
        while ((*macmdioar & 1u) && --to) {}
        uart_puts("  MACMDIOAR: ");
        uart_puthex(*macmdioar);
        uart_puts("\n  MACMDIODR: ");
        uart_puthex(*macmdiodr);
        uart_puts(" (timeout left: ");
        uart_putdec(to);
        uart_puts(")\n");
    }

    /* Initialize Ethernet MAC + PHY */
    uart_puts("Initializing Ethernet MAC...\n");
    ll = wolfIP_getdev(IPStack);
    ret = stm32_eth_init(ll, NULL);
    if (ret < 0) {
        uart_puts("  ERROR: stm32_eth_init failed (");
        uart_puthex((uint32_t)ret);
        uart_puts(")\n");
    } else {
        uart_puts("  PHY link: ");
        uart_puts((ret & 0x100) ? "UP" : "DOWN");
        uart_puts(", PHY addr: ");
        uart_puthex(ret & 0xFF);
        uart_puts("\n  MAC: ");
        {
            int mi;
            for (mi = 0; mi < 6; mi++) {
                if (mi > 0) uart_puts(":");
                uart_puthex8(ll->mac[mi]);
            }
        }
        uart_puts("\n");
    }

    /* Static IP configuration */
    {
        ip4 ip = atoip4(WOLFIP_IP);
        ip4 nm = atoip4(WOLFIP_NETMASK);
        ip4 gw = atoip4(WOLFIP_GW);
        uart_puts("Setting IP configuration:\n");
        uart_puts("  IP: ");
        uart_putip4(ip);
        uart_puts("\n  Mask: ");
        uart_putip4(nm);
        uart_puts("\n  GW: ");
        uart_putip4(gw);
        uart_puts("\n");
        wolfIP_ipconfig_set(IPStack, ip, nm, gw);
    }

    /* TCP echo server on port 7 */
    uart_puts("Creating TCP socket on port 7...\n");
    listen_fd = wolfIP_sock_socket(IPStack, AF_INET, IPSTACK_SOCK_STREAM, 0);
    wolfIP_register_callback(IPStack, listen_fd, echo_cb, IPStack);

    memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_port = ee16(ECHO_PORT);
    addr.sin_addr.s_addr = 0;
    (void)wolfIP_sock_bind(IPStack, listen_fd, (struct wolfIP_sockaddr *)&addr,
        sizeof(addr));
    (void)wolfIP_sock_listen(IPStack, listen_fd, 1);

    uart_puts("Entering main loop. Ready for connections!\n");
    uart_puts("  TCP Echo: port 7\n");

    for (;;) {
        (void)wolfIP_poll(IPStack, tick++);

        /* Toggle LED every ~256K iterations as heartbeat */
        if ((tick & 0x3FFFFu) == 0) {
            led_toggle();
        }
    }
    return 0;
}
